Revit 2027 API
ParameterTypeId.FabricationProductDataSpecification Property
 "Product Specification Description"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationProductDataSpecification { get; }
Public Shared ReadOnly Property FabricationProductDataSpecification As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationProductDataSpecification {
	ForgeTypeId^ get ();
}
static member FabricationProductDataSpecification : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace